import 'package:flutter/material.dart';
import 'package:flutter_share/flutter_share.dart';
import 'package:flutter_widget_from_html_core/flutter_widget_from_html_core.dart';

class IntroductionDictionary extends StatelessWidget {
  const IntroductionDictionary({super.key});
 Future<void> share() async {
    await FlutterShare.share(
      title: "مقدمة",
      text:"المقدمة: بِسْمِ اللهِ الرَّحْمَنِ الرَّحيمِ قال الشيخُ الإِمامُ الأجلُّ الأوحدُ العالم. أبو منصورٍ موهوبُ بنُ أحمدَ بن مـحمد بن الخَضِرِ [الجوالِيقي] أطال اللهُ بقاءَه، وحَرَس مُدَّته وحَوْبَاءَهُ: هذا كتابٌ نذكرُ فيه ما تكلمتْ به العرب من الكلام الأعجميِّ، ونطق به القرآنُ الـمَـجِيد، ووردَ في أخبار الرسولِ صلى الله عليه وسلم والصحابة والتابعين، رضوانُ الله عليهم [أجمعين]، وذَكَرتْهُ العربُ في أشعارها وأخبارِها؛ ليُعْرَفَ الدخيل من الصَّرِيح. ففي معرفة ذلك فائدةٌ جليلةٌ، وهي أن يحترِس المشْتَقُّ فلا يجعلَ شيئًا من لغة العرب لشيءٍ من لغة العجمِ. فقد قال [أبوبكر] بنُ السَرَّاجِ في رسالته في الاشتقاق، في (باب ما يَجبُ على الناظر في الاشتقاق أن يَتَوقَّاهُ ويحترسَ منه): «مِمّا ينبغي أن يَحْذَرَ منه كلَّ الحَذَرِ أن يَشْتَقَّ من لغة العرب لشيءٍ من لغة العجمِ، فيكونَ بمنزلة من ادَّعَى أن الطيرَ وَلَدُ الحُوتِ». [وحُكِيَ عن أبي عليٍّ قال: رأيتُ أبا بكرٍ يُدِيرُ هذه اللفظةَ «بُوصِيٌّ» ليَشْتَقَّها، فقلتُ: أين تذهبُ، إنّها فارسيةٌ، إنما هو «بُوزيد» وهو اسمُ جَدِّنَا! قال: ومعناهُ: السَّالمُ. فقال أبوبكرٍ: فَرَّجْتَ عَنِّي]. فأمّا ما ورد منه في القرآن، فقد اختلفَ فيه أهلُ العلم: [فـ]ــقال بعضهم: كتابُ الله [تعالی] ليس فيه شيءٌ من غَير العربيَّةِ. أخبرنِي غيرُ واحدٍ عن الحسن بن أحمدَ عن دَعْلَجٍ عن علي بن عبد العزيز عن أبي عُبَيْدٍ قال: سمعت أبا عُبَيْدة يقول: من زعم أن في القرآن لسانًا سوى العربية فقد أَعْظَمَ عَلى اللهِ القولَ. واحتج بقوله تعالى: ﴿إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا﴾، سورة الزخرف (3). قال أبو عبيدٍ: ورُوي عن ابن عباسٍ ومجاهدٍ وعكْرِمَةَ وغيرهِم، في أحرفٍ كثيرة: أنه من غير لسان العرب، مثلُ «سجِّيل» و«المِشْکاةِ» و«اليَمِّ» و«الطُّورِ» و«أَبَارِيقَ» و«إسْتَبْرقٍ» وغيرِ ذلك. فهؤلاء أعلم بالتأويل من أبي عُبيدةَ. ولكنهم ذَهبوا إلى مذهبٍ، وذهب هذا إلى غيره. وكلاهما مصيبٌ إن شاء الله تعالی. وذلك: أن هذه الحروف بغير لسان العرب في الأصلِ، فقال أولئك على الأصل، ثم لفظتْ به العرب بألسنتها، فعرَّبَتْه، فصار عربيًّا بتعريبها إيَّاه، فهي عربيةٌ في هذه الحال، أعجميةُ الأصلِ. فهذا القولُ يُصَدِّقُ الفريقين جميعًا. والأسماءُ المعَرَّبةُ [في الصَّرْفِ وتركِه] على ضربين: أحدُهما لا يُعْتَدُّ بعُجْمَتِه، وهو ما أُدخل عليه لام التَّعريفِ، نحو «الدِّيباج» و«الدِّيوان». والثاني: ما يُعْتَدُّ بعجمته. وهو ما لم يُدْخلُوا عليه لامَ التعريفِ كـ«ـموسی» و«عيسی».المصدر: الجواليقي، المعرّب من الكلام الأعجمي على حروف المعجم، تح: أحمد محمد شاكر، مطبعة دار الكتب والوثائق القومية، القاهرة، مصر، ط5، 2020م، ص:3/4/5.",
    );
  }
  @override
  Widget build(BuildContext context) {
    return Container(
      padding: const EdgeInsets.all(2.0),
      margin:  const EdgeInsets.only(top: 80.0),
      child: Stack(
        children: [
          Container(
            padding: EdgeInsets.symmetric(vertical:10, horizontal: 3),
            margin: EdgeInsets.all(0),
            decoration: BoxDecoration(
                color: Colors.white, borderRadius: BorderRadius.circular(10)),
            child:  SingleChildScrollView(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: HtmlWidget('<h1 style="direction: rtl; text-align: center;"><span style="color: #0000ff;">المقدّمة</span></h1><h2 style="direction: rtl; text-align: center;"><span style="color: #000000;">بِسْمِ اللهِ الرَّحْمَنِ الرَّحيمِ </span></h2><h2 style="direction: rtl; text-align: justify;">قال الشيخُ الإِمامُ الأجلُّ الأوحدُ العالم. <span style="color: #ff0000;">أبو منصورٍ موهوبُ بنُ أحمدَ بن مـحمد بن الخَضِرِ</span> [الجوالِيقي] أطال اللهُ بقاءَه، وحَرَس مُدَّته وحَوْبَاءَهُ: هذا كتابٌ نذكرُ فيه ما تكلمتْ به العرب من الكلام الأعجميِّ، ونطق به القرآنُ الـمَـجِيد، ووردَ في أخبار الرّسولِ صلى الله عليه وسلم والصحابة والتابعين، رضوانُ الله عليهم [أجمعين]، وذَكَرتْهُ العربُ في أشعارها وأخبارِها؛ ليُعْرَفَ الدخيل من الصَّرِيح. ففي معرفة ذلك فائدةٌ جليلةٌ، وهي أن يحترِس المشْتَقُّ فلا يجعلَ شيئًا من لغة العرب لشيءٍ من لغة العجمِ. فقد قال [أبوبكر] بنُ السَرَّاجِ في رسالته في الاشتقاق، في <span style="color: #008000;">(باب ما يَجبُ على الناظر في الاشتقاق أن يَتَوقَّاهُ ويحترسَ منه)</span>: &laquo;مِمّا ينبغي أن يَحْذَرَ منه كلَّ الحَذَرِ أن يَشْتَقَّ من لغة العرب لشيءٍ من لغة العجمِ، فيكونَ بمنزلة من ادَّعَى أن الطيرَ وَلَدُ الحُوتِ&raquo;. [وحُكِيَ عن أبي عليٍّ قال: رأيتُ أبا بكرٍ يُدِيرُ هذه اللفظةَ <span style="color: #ff0000;">&laquo;بُوصِيٌّ&raquo;</span> ليَشْتَقَّها، فقلتُ: أين تذهبُ، إنّها <span style="color: #008000;">فارسيةٌ</span>، إنما هو <span style="color: #ff0000;">&laquo;بُوزيد&raquo;</span> وهو اسمُ جَدِّنَا! قال: ومعناهُ: السَّالمُ. فقال أبوبكرٍ: فَرَّجْتَ عَنِّي]. فأمّا ما ورد منه في القرآن، فقد اختلفَ فيه أهلُ العلم: [فـ]ــقال بعضهم: كتابُ الله [تعالی] ليس فيه شيءٌ من غَير العربيَّةِ. أخبرنِي غيرُ واحدٍ عن الحسن بن أحمدَ عن دَعْلَجٍ عن علي بن عبد العزيز عن أبي عُبَيْدٍ قال: سمعت أبا عُبَيْدة يقول: من زعم أن في القرآن لسانًا سوى العربية فقد أَعْظَمَ عَلى اللهِ القولَ. واحتج بقوله تعالى: <span style="color: #008000;">﴿إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا﴾</span>، <span style="color: #008000;">سورة الزخرف (3)</span>. قال أبو عبيدٍ: ورُوي عن ابن عباسٍ ومجاهدٍ وعكْرِمَةَ وغيرهِم، في أحرفٍ كثيرة: أنه من غير لسان العرب، مثلُ &laquo;سجِّيل&raquo; و&laquo;المِشْکاةِ&raquo; و<span style="color: #ff0000;">&laquo;اليَمِّ&raquo;</span> و<span style="color: #ff0000;">&laquo;الطُّورِ&raquo;</span> و<span style="color: #ff0000;">&laquo;أَبَارِيقَ&raquo;</span> و<span style="color: #ff0000;">&laquo;إسْتَبْرقٍ&raquo;</span> وغيرِ ذلك. فهؤلاء أعلم بالتأويل من أبي عُبيدةَ. ولكنهم ذَهبوا إلى مذهبٍ، وذهب هذا إلى غيره. وكلاهما مصيبٌ إن شاء الله تعالی. وذلك: أن هذه الحروف بغير لسان العرب في الأصلِ، فقال أولئك على الأصل، ثم لفظتْ به العرب بألسنتها، فعرَّبَتْه، فصار عربيًّا بتعريبها إيَّاه، فهي عربيةٌ في هذه الحال، أعجميةُ الأصلِ. فهذا القولُ يُصَدِّقُ الفريقين جميعًا. والأسماءُ المعَرَّبةُ [في الصَّرْفِ وتركِه] على ضربين: أحدُهما لا يُعْتَدُّ بعُجْمَتِه، وهو ما أُدخل عليه لام التَّعريفِ، نحو <span style="color: #ff0000;">&laquo;الدِّيباج&raquo;</span> و<span style="color: #ff0000;">&laquo;الدِّيوان&raquo;</span>. والثاني: ما يُعْتَدُّ بعجمته. وهو ما لم يُدْخلُوا عليه لامَ التعريفِ كـ<span style="color: #ff0000;">&laquo;ـموسی&raquo;</span> و<span style="color: #ff0000;">&laquo;عيسی&raquo;</span>.</h2><h4 style="text-align: right;"><span style="color: #3366ff;">ا<span style="color: #0000ff;">لمصدر: الجواليقي، المعرّب من الكلام الأعجمي على حروف المعجم، تح: أحمد محمد شاكر، مطبعة دار الكتب والوثائق القومية، القاهرة، مصر، ط5، 2020م، ص:3/4/5</span></span><span style="color: #0000ff;">.</span></h4>',
                                                textStyle:
                                                    TextStyle(color: Colors.black54),
                                              ),
              ),
            ),
          ),
           Positioned(
              bottom: 0,
              left: 0,
              child: InkWell(
                onTap: () {
                  share();
                },
                child: Image.asset("assets/icons/share_icon.png"),
              ))
        ],
      ),
    );
  }
}
